Revit 2027 API
ViewShapeBuilder Methods
The ViewShapeBuilder type exposes the following members.
Methods
Name | Description
AddCurve |  Add a curve to the GRep associated to this ViewShapeBuilder.
Dispose
(Inherited from ShapeBuilder)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Reset |  Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values.
ToString | Returns a string that represents the current object.
(Inherited from Object)
ValidateCurve(Curve) |  Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. Expects a valid view normal to be set prior to the call.
ValidateCurve(Curve, DirectShapeTargetViewType) |  Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException
ValidateShape |  Validates a shape represented as a collection of geometry objects for use as a view-specific shape. The objects are expected to be either points, curves or polylines. Curves are expected to be flat and lie in a plane perpendicular to view normal as defined by view type.
ValidateViewType |  Validates the incoming view type. As of today, the only allowed view type is Plan.
Top
See Also
Reference
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace